src/Catalogs/ПользователиХранилища.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПользователиХранилища</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Хранилища</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._УчетныеЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/_ПользователиВызовСервера/Ext/Module.bsl
Функция ПараметрыПользователя( Знач пИмяИлиСсылка, Знач пХранилище = Неопределено) Экспорт
	
	Если ТипЗнч( пИмяИлиСсылка ) = Тип( "Строка" ) Тогда
		
		Запрос       = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВЫБОР
			|		КОГДА ПользователиХранилища.УчетнаяЗапись = ЗНАЧЕНИЕ(Справочник._УчетныеЗаписи.ПустаяСсылка)
			|			ТОГДА ПользователиХранилища.Email
			|		ИНАЧЕ ПользователиХранилища.УчетнаяЗапись.Email
			|	КОНЕЦ КАК Email,
			|	ВЫБОР
			|		КОГДА ПользователиХранилища.УчетнаяЗапись = ЗНАЧЕНИЕ(Справочник._УчетныеЗаписи.ПустаяСсылка)
			|			ТОГДА ПользователиХранилища.ИмяПользователя
			|		ИНАЧЕ ПользователиХранилища.УчетнаяЗапись.Наименование
			|	КОНЕЦ КАК Имя,
			|	ПользователиХранилища.УчетнаяЗапись,
			|	ПользователиХранилища.Ссылка
			|ИЗ
			|	Справочник.ПользователиХранилища КАК ПользователиХранилища
			|ГДЕ
			|	ПользователиХранилища.Наименование = &Наименование
			|	И ПользователиХранилища.Владелец = &Владелец";
		Запрос.УстановитьПараметр( "Наименование", пИмяИлиСсылка );
		Запрос.УстановитьПараметр( "Владелец", пХранилище );
		
	Иначе
		
		Запрос       = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВЫБОР
			|		КОГДА ПользователиХранилища.УчетнаяЗапись = ЗНАЧЕНИЕ(Справочник._УчетныеЗаписи.ПустаяСсылка)
			|			ТОГДА ПользователиХранилища.Email
			|		ИНАЧЕ ПользователиХранилища.УчетнаяЗапись.Email
			|	КОНЕЦ КАК Email,
			|	ВЫБОР
			|		КОГДА ПользователиХранилища.УчетнаяЗапись = ЗНАЧЕНИЕ(Справочник._УчетныеЗаписи.ПустаяСсылка)
			|			ТОГДА ПользователиХранилища.ИмяПользователя
			|		ИНАЧЕ ПользователиХранилища.УчетнаяЗапись.Наименование
			|	КОНЕЦ КАК Имя,
			|	ПользователиХранилища.УчетнаяЗапись,
			|	ПользователиХранилища.Ссылка
			|ИЗ
			|	Справочник.ПользователиХранилища КАК ПользователиХранилища
			|ГДЕ
			|	ПользователиХранилища.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр( "Ссылка", пИмяИлиСсылка );
		
	КонецЕсли;
	
	выборка = Запрос.Выполнить().Выбрать();
	
	структ = Новый Структура;
	структ.Вставить( "Ссылка" );
	структ.Вставить( "Email" );
	структ.Вставить( "Имя" );
	структ.Вставить( "УчетнаяЗапись" );
	
	Если выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств( выборка, структ );
		
	КонецЕсли;
	
	Возврат структ;
	
КонецФункции
